labwork5/src/Documents/ПосещениеЭкскурсии/ПосещениеЭкскурсии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПосещениеЭкскурсии</name>
  <basedOn>Document.Бронь</basedOn>
  <registerRecords>AccumulationRegister.ПродажиЭкскурсий</registerRecords>
  <attributes>
    <name>Бронь</name>
    <type>
      <types>DocumentRef.Бронь</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Экскурсии</name>
    <attributes>
      <name>Экскурсия</name>
      <type>
        <types>CatalogRef.Экскурсии</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

labwork5/src/AccumulationRegisters/ПродажиЭкскурсий/ПродажиЭкскурсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажиЭкскурсий</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экскурсия</name>
    <type>
      <types>CatalogRef.Экскурсии</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

labwork5/src/Documents/ПосещениеЭкскурсии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ПродажиЭкскурсий
	Движения.ПродажиЭкскурсий.Записывать = Истина;
	Для Каждого ТекСтрокаЭкскурсии из Экскурсии Цикл
		Движение = Движения.ПродажиЭкскурсий.Добавить();
		Движение.Период = Дата;
		Движение.СпособОплаты = СпособОплаты;
		Движение.Экскурсия = ТекСтрокаЭкскурсии.Экскурсия;
		Движение.Сумма = Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Бронь") Тогда
		// Заполнение шапки
		Бронь = ДанныеЗаполнения.Ссылка;
		Клиент = ДанныеЗаполнения.Клиент;
		Сумма = ДанныеЗаполнения.ОбщаяСтоимость;
		Для Каждого ТекСтрокаЭкскурсии из ДанныеЗаполнения.Экскурсии Цикл
			НоваяСтрока = Экскурсии.Добавить();
			НоваяСтрока.Экскурсия = ТекСтрокаЭкскурсии.Экскурсия;
			НоваяСтрока.Количество = ТекСтрокаЭкскурсии.Количество;
			НоваяСтрока.Цена = ТекСтрокаЭкскурсии.Цена;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
